app/controllers/api/v1/noodles_controller.rb

    def index
        noodles = Noodle.all
---
SELECT "noodles".* FROM "noodles"