app/controllers/api/v1/scores_controller.rb

    def index
        scores = Score.all
---
SELECT "scores".* FROM "scores"