app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."guesses" ASC
---
    def index
        # byebug
        users = User.order(:guesses)