app/controllers/api/v1/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "guesses", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Chewie"], ["guesses", 2], ["created_at", "2020-06-17 21:45:22.608329"], ["updated_at", "2020-06-17 21:45:22.608329"]]